package com.zhang.daka.kaoshi.huibian

/**
 * Created by zhangyuncai on 2019/11/29.
 */
val wangluo="""



1、以下关于DHCP协议的描述中，错误的是（     ）
A. DHCP协议在传输层一般采用UDP协议
B. DHCP服务器使用熟知端口号67
答:C. 客户端按照UDP规定要使用临时端口号
D. 为发现DHCP服务器，客户端首先发送一个“DHCPDISCOVER”请求报文

2、采用CSMA/CD介质访问控制方法的局域网适用于办公自动化环境。这类局域网在何种网络通信负荷情况下表现出较好的吞吐率与延迟特性？（    ）。
A. 较高
B. 较低
答:C. 中等
D. 不限定

3、实现互联网中电子邮件传送功能的协议是（   ）。
A. SNMP
答:B. SMTP
C. DNS
D. OSPF

4、以下关于直接序列扩频通信基本概念的描述中，错误的是（  ）。
A. DSSS将数据经过伪随机码进行异或操作后再发送
答:B. 所有结点按照规定的时间间隔变换频段
C. 发送端与接收端是用相同的伪随机码
D. 直接序列扩频通信具有很强的抗干扰能力

5、以下关于SIP请求报文名称及意义的描述中，错误的是（    ）
A. INVITE表示邀请用户或服务器参加一个会话，启动会话连接的建立
B. ACK表示用户或服务器同意参加一个会话，确认会话的建立
答:C. CANCEL表示终止会话
D. INFO表示传递PSTN电话信令

6、计算机网络的基本分类方法主要有两种：一种是根据网络所使用的传输技术；另一种是根据（     ）。
A. 网络协议
B. 网络操作系统类型
答:C. 覆盖范围与规模
D. 网络服务器类型与规模

7、IEEE 802.3标准的以太网的物理地址长度为（     ）。
A. 8bit
B. 32bit
答:C. 48bit
D. 64bit

8、以下关于MPLS的描述中，错误的是（    ）
A. MPLS在IP网络中提供一种面向连接的服务
答:B. 流中的各个分组在QoS需求与路由上可以不相关
C. MPLS提供了支持VPN的有效机制
D. MPLS提供了支持多种协议的功能

9、关于防火墙的功能，以下哪一种描述是错误的？（ ）。
A. 防火墙可以检查进出内部网的通信量
B. 防火墙可以使用应用网关技术在应用层上建立协议过滤和转发功能
C. 防火墙可以使用过滤技术在网络层对数据包进行选择
答:D. 防火墙可以阻止来自内部的威胁和攻击

10、以下关于字符同步方法的描述中，错误的是（     ）。
A. 实现字符同步用两种方法：同步传输和异步传输
B. 同步传输将字符组织成组，以组为单位连续传送
答:C. 同步传输规定在每组字符之前加上一个同步字符SYN
D. 异步传输中每个字符作为一个独立的整体发送，字符之间的时间间隔可以是任意的

11、TCP/IP协议参考模型共分了      层。

4

12、在TCP/IP层次模型的第三层（网络层）中包括的协议主要有                  及                 、                 、                 。

答:ARP ;RARP ;IP ;ICMP

13、串行数据通信的方向性结构有三种，即单工、           和            。

答:半双工 ;全双工

14、10BASE－T标准规定的网络拓扑结构是       ，网络速率是10Mbps  ，网络所采用的网络介质是        ，信号是          。

答:星型 ;双绞线 ;基带

15、从局域网媒体访问控制方法的角度可以把局域网划分为         局域网和TOKEN RING局域网两大类。

答:CSMA/CD

16、实现防火墙的技术主要有两种，分别是         和           。

答:包过滤 ;应用级网关

17、计算机网络的主要功能为          共享和         共享. 用户之间的信息交换。

答:硬件资源 ;软件资源

18、IEEE802.3规定了一个数据帧的长度为                 字节到                 字节之间。

答:64 ;1518

19、OSI体系结构包括：物理层，             ，              ，运输层，            ， 表示层，           。

答:数据链路层 ;网络层 ;会话层 ;表示层

20、网络按覆盖的范围可分为广域网、     、局域网。

答:城域网

21、IP地址是由两个固定长度的字段组成的，这两个字段分别是：         ，           。

答:网络号 ;主机号

22、在计算机网络的诸多功能中，            和             是其最基本的功能。

答:通信 ;资源共享

23、IP地址是由两个固定长度的字段组成的，这两个字段分别是：         ，           。

答:网络号 ;主机号

24、在TCP/IP参考模型的传输层上,               协议实现的是一种面向无连接的协议,它不能提供可靠的数据传输,并且没有差错检验。

答:IP

25、数据传输的同步技术有两种：                ，                  。

答:同步传输 ;异步传输

26、IEEE802的数据链路层分为两个功能子层:                 ，                   。

答:逻辑链路控制子层/LLC ;介质(媒体)访问控制子层/MAC

27、计算机网络最主要的两个性能指标是 带宽 和      。

答:时延

28、以太网采用的拓扑结构是       。

答:星型

29、电子邮件系统提供的是一种   ___  服务。

答:存储转发式

30、ATM网络采用固定长度的信元传送数据，信元长度为     。

答:53B

31、子网掩码中“1”代表       。

答:网络地址部分

32、目前无线局域网采用的拓扑结构主要有        、多点方式、中继方式。

答:点对点方式

33、RS-232-C接口规范的内容包括四个方面特性，即机械特性、电气特性、功能特性和             。

答:过程特性

34、FTP服务器进程的保留端口号是          。
答:21

35、计算机网络常用的交换技术有电路交换、          和           。

答:报文交换 ;分组交换

36、计算机网络系统由             和资源子网组成。

答:通信子网

37、局域网可采用多种通信介质，如________，________或________等。

答:双绞线 ;同轴电缆 ;光线

38、在TCP/IP协议簇中，运输层的          提供了一种可靠的数据流服务。

答:TCP

39、按IP地址分类，地址：160.201.68.108属于                 类地址。

答:B

40、信道复用技术有.                、                、_________________。

答:时分多路复用 ;频分多路复用 ;波分多路复用

1、VLAN在现代组网技术中占有重要地位，同一个VLAN中的两台主机（   ）。
A. 必须连接在同一交换机上
答:B. 可以跨越多台交换机
C. 必须连接在同一集线器上
D. 可以跨业多台路由器

2、在直接交换方式中，局域网交换机只要接受并检测到目的地址字段，就立即将该帧转发出去，而不管这一帧数据是否出错。帧出错检测任务由以下哪种设备完成（     ）。
A. 源主机
答:B. 目的主机
C. 中继器
D. 集线器

3、计算机网络的基本分类方法主要有两种：一种是根据网络所使用的传输技术；另一种是根据（     ）。
A. 网络协议
B. 网络操作系统类型
答:C. 覆盖范围与规模
D. 网络服务器类型与规模

4、以下关于字符同步方法的描述中，错误的是（     ）。
A. 实现字符同步用两种方法：同步传输和异步传输
B. 同步传输将字符组织成组，以组为单位连续传送
答:C. 同步传输规定在每组字符之前加上一个同步字符SYN
D. 异步传输中每个字符作为一个独立的整体发送，字符之间的时间间隔可以是任意的

5、一下关于冲突检测的描述中，错误的是（    ）
A. 多个结点同时使用共享的公共传输介质发送数据就会出现冲突
B. 冲突是由于电磁波在总线传输介质中的传播延时造成的
C. 传播延时的2倍时间，冲突的数据帧已经传遍了整个网段
答:D. Ethernet协议标准中规定的冲突窗口时间为5.12us

6、关于防火墙的功能，以下哪一种描述是错误的？（ ）。
A. 防火墙可以检查进出内部网的通信量
B. 防火墙可以使用应用网关技术在应用层上建立协议过滤和转发功能
C. 防火墙可以使用过滤技术在网络层对数据包进行选择
答:D. 防火墙可以阻止来自内部的威胁和攻击

7、DNS服务器和客户机设置完毕后，有三个命令可以测试其设置是否正确，下面哪个不是其中之一（ ）
A. PING
答:B. LOGIN
C. IPCONFIG
D. NSLOOKUP

8、某单位已经组建了多个Ethernet工作组网络，如果计划将这些工作网络通过主干网互连，那么下面哪一种是主干网优选的网络技术（     ）。
A. 帧中断
B. ATM
C.  FDDI
答:D. 千兆以太网

9、以下关于子网概念的描述中，错误的是（    ）
A. 划分子网是将网络划分成多个部分，对于外部网络仍然像一个网络一样
B. 三级层次的IP地址是：网络号——子网号——主机号
C. 同一个子网中的所有主机必须使用不同的主机号
答:D. 子网的概念只用于A类，B类IP地址

10、采用CSMA/CD介质访问控制方法的局域网适用于办公自动化环境。这类局域网在何种网络通信负荷情况下表现出较好的吞吐率与延迟特性？（    ）。
A. 较高
B. 较低
答:C. 中等
D. 不限定

11、计算机网络最主要的两个性能指标是 带宽 和      。

答:时延

12、FTP服务器进程的保留端口号是          。

答:21

13、数据传输的同步技术有两种：                ，                  。

答:同步传输 ;异步传输

14、以太网采用的拓扑结构是       。

答:星型

15、在计算机网络的诸多功能中，            和             是其最基本的功能。

答:通信 ;资源共享

16、在TCP/IP层次模型的第三层（网络层）中包括的协议主要有                  及                 、                 、                 。

答:ARP ;RARP ;IP ;ICMP

17、计算机网络的主要功能为          共享和         共享. 用户之间的信息交换。

答:硬件资源 ;软件资源

18、子网掩码中“1”代表       。

答:网络地址部分

19、计算机网络系统由             和资源子网组成。

答:通信子网

20、目前无线局域网采用的拓扑结构主要有        、多点方式、中继方式。

答:点对点方式

21、OSI体系结构包括：物理层，             ，              ，运输层，            ， 表示层，           。

答:数据链路层 ;网络层 ;会话层 ;表示层

22、IP地址是由两个固定长度的字段组成的，这两个字段分别是：         ，           。

答:网络号 ;主机号

23、串行数据通信的方向性结构有三种，即单工、           和            。

答:半双工 ;全双工

24、IP地址是由两个固定长度的字段组成的，这两个字段分别是：         ，           。

答:网络号 ;主机号

25、在TCP/IP参考模型的传输层上,               协议实现的是一种面向无连接的协议,它不能提供可靠的数据传输,并且没有差错检验。

答:IP

26、IEEE802的数据链路层分为两个功能子层:                 ，                   。

答:逻辑链路控制子层/LLC ;介质(媒体)访问控制子层/MAC

27、TCP/IP协议参考模型共分了      层。

答:4

28、电子邮件系统提供的是一种   ___  服务。

答:存储转发式

29、网络按覆盖的范围可分为广域网、     、局域网。

答:城域网

30、ATM网络采用固定长度的信元传送数据，信元长度为     。

答:53B

31、实现防火墙的技术主要有两种，分别是         和           。

答:包过滤 ;应用级网关

32、RS-232-C接口规范的内容包括四个方面特性，即机械特性、电气特性、功能特性和             。

答:过程特性

33、计算机网络常用的交换技术有电路交换、          和           。

答:报文交换 ;分组交换

34、从局域网媒体访问控制方法的角度可以把局域网划分为         局域网和TOKEN RING局域网两大类。

答:CSMA/CD

35、10BASE－T标准规定的网络拓扑结构是       ，网络速率是10Mbps  ，网络所采用的网络介质是        ，信号是          。

答:星型 ;双绞线 ;基带

36、局域网可采用多种通信介质，如________，________或________等。

答:双绞线 ;同轴电缆 ;光线

37、在TCP/IP协议簇中，运输层的          提供了一种可靠的数据流服务。

答:TCP

38、IEEE802.3规定了一个数据帧的长度为                 字节到                 字节之间。

答:64 ;1518

39、按IP地址分类，地址：160.201.68.108属于                 类地址。

答:B

40、信道复用技术有.                、                、_________________。

答:时分多路复用 ;频分多路复用 ;波分多路复用

1、下面协议中,用于WWW传输控制的是（ ）。
A. URL
B. SMTP
答:C. HTTP
D. HTML

2、以下关于CSMA/CA冲突避免的描述中，错误的是（    ）。
A. 802.11的MAC层采用了虚拟监听器
B. 802.11的MAC层在帧格式的第2个字段设置了一个2字节的“持续时间”
C. 网中的其他结点在收到正在帧头“持续时间”的通知后调整网络分配向量值
答:D. 网络分配向量值等于发送一帧的时间加上SIFS时间

3、以下关于PPP信息帧的描述中，错误的是(      )。
答:A. 标志字段值为0x6E
B. 地址字段值为0xFF
C. 控制字段值为03
D. 协议字段对于IP协议之为0021H

4、以下关于宽带城域网的核心交换层基本功能的描述中，错误的是（   ）。
A. 将多个汇聚层连接起来，为汇聚层提供高速分组转发
B. 为整个城域网提供一个高速、安全与具有服务质量保障能力的数据传输环境
答:C. 提供宽带城域网用户访问互联网所需要的接入服务
D. 实现与地区或国家主干网络的互联，提供城市的宽带IP数据出口

5、下面提供FTP服务的默认TCP端口号是（ ）。
答:A. 21
B. 25
C. 23
D. 80

6、以下关于802.11无线局域网基本概念的描述中，错误的是（    ）。
A. 802.11的物理层定义了红外、跳频扩频与直接序列扩频的数据传输标准
B. 802.22的MAC层支持多个接入点的漫游，同时提供数据验证与保密服务
C. 802.11的MAC层采用CSMA/CA算法
答:D. 802.11的网络层支持按需的路由选择协议

7、对局域网来说，网络控制的核心是（ ）。
A. 工作站
B. 网卡
答:C. 网络服务器
D. 网络互连设备

8、典型的局域网可以看成由以下三部分组成：网络服务器、工作站与
A. IP地址
答:B. 通信设备
C. TCP/IP协议
D. 网卡

10、以下关于Ethemet接收流程的描述中，错误的是(     )。
A. 所有结点只要不发送数据，就应该处干接收状态
B. 如果接收帧长度小于规定的帧最小长度，则表明发生冲突，丢弃该帧
C. 结点完成一帧数据接收后，首先需要检查帧的目的地址
答:D. 如果CRC校验正确，则进一步检测LLC数据长度是不是8bit的整数倍

计算机网络最主要的两个性能指标是 带宽 和      。
答:时延

子网掩码中“1”代表       。
答:网络地址部分

电子邮件系统提供的是一种   ___  服务。
答:存储转发式

用户在利用客户端邮件应用程序从邮件服务器接收邮件时通常使用的协议是（ ）
A. FTP
答:B. POP3
C. HTTP
D. SMT

如果IP地址为202.130.191.33，屏蔽码为255.255.255.0，那么网络地址是什么？（ ）。
A. 202.130.0.0
B. 202.0.0.0
C. 202.130.191.33
答:D. 202.130.191.0


以下关于路由器的描述中，错误的是（ ）
A. 路由器是一种具有多个输入端口和多个输出端口，转发分组的专用计算机系统
B. 路由器结构由路由选择和分组转发两部分组成
答:C. 路由选择处理器根据路由表为进入的分组选择输出端口
D. 衡量路由器性能的重要参数是路由器每秒钟能够处理的分组数

广域网一般采用网状拓扑构型，该构型的系统可操性高，但是结构复杂。为了实现正确的传输必须采用（ ）。 Ⅰ.光纤传输技术       Ⅱ.路由选择算法 Ⅲ.无线通信技术       Ⅳ.流量控制方法
A. Ⅰ和Ⅱ
B. Ⅰ和Ⅲ
答:C. Ⅱ和Ⅳ
D. Ⅲ和Ⅳ

异步传输模式技术中“异步”的含义是（ ）。
A. 采用的是异步串行通信技术
B. 网络接口采用的是异步控制方式
C. 周期性地插入ATM信元
答:D. 随时插入ATM信元

应用层DNS协议主要用于实现哪种网络服务功能？（    ）。
A. 网络设备名字到IP地址的映射
B. 网络硬件地址到IP地址的映射
C. 进程地址到IP地址的映射
D. 用户名到进程地址的映射

当一台计算机从FTP服务器下载文件时，在该FTP服务器上对数据进行封装的五个转换步骤是（ ）。
A. 比特，数据帧，数据包，数据段，数据
答:B. 数据，数据段，数据包，数据帧，比特
C. 数据包，数据段，数据，比特，数据帧
D. 数据段，数据包，数据帧，比特，数据

网络协议的语义规定了需要发出何种控制信息，以及完成的动作与（   ）。
A. 语法
答:B. 响应
C. 层次
D. 服务


Internet的网络层含有四个重要的协议，分别为 （ ）。
A. IP，ICMP，ARP，UDP
B. TCP，ICMP，UDP，ARP
答:C.  IP，ICMP，ARP，RARP
D. UDP，IP，ICMP，RARP



以下关于FDDI技术特定的描述中，错误的是（   ）。
A. 设计FDDI的目的是实现高速、高可靠性和大范围局域网互联
B. FDDI采用了光纤作为传输介质
答:C. FDDI的传输速率为1Gbps
D. FDDI可以用于100km范围内的局域网互联

以下关于TCP支持全双工服务的描述中，错误的是（ ）。
A. TCP允许通信双方的应用程序在任何时候发送数据
B. 通信的双方都设置有发送和接收缓冲区
C. 应用程序将要发送的数据字段提交给发送缓冲区，数据发送过程由TCP协议来控制
答:D. 接收端将接收数据存放到接收缓冲区，TCP程序在合适的时间到缓冲区中读取数据

以下关于HTTP应答报文代码的描述中，错误的是（    ）
A. 200系列的代码表示请求成功
答:B. 300系列的代码表示客户定向到另一个IP
C. 400系列的代码表示客户端的差错
D. 500系列的代码表示服务器端的差错

以下有关UDP校验和的描述中，错误的是（ ）。
A. 伪报头只是在计算时临时和UDP用户数据报连接在一起的
答:B. 伪报头只是在计算时起作用，它不向低层传输，只向高层传输
C. 发送端将校验和字段置0，再将伪报头与UDP用户数据作为一个整体来计算
D. 以每列16位为单位，将二进制位按低位到高位逐列进行计算

应用层DNS协议主要用于实现哪种网络服务功能？（    ）。
答:A. 网络设备名字到IP地址的映射
B. 网络硬件地址到IP地址的映射
C. 进程地址到IP地址的映射
D. 用户名到进程地址的映射

判断下面哪一句话是正确的。（ ）。
A. Internet中的一台主机只能有一个IP地址
答:B. 一个合法的IP地址在一个时刻只能分配给一台主机
C. Internet中的一台主机只能有一个主机名
D. IP地址与主机名是一一对应的

分组交换技术的3个重要概念是：分组、存储转发与（    ）。
答:A. 路由选择
B. 分组交付
C. 网络安全
D. 网络交换

3、以下关于ASCII码的描述中，错误的是（   ）。
A. ASCII码是一个用于计算机内码，同时也用于数据通信的编码标准
B. ASCII码采用7个二进制位编码，可以表示128个字符
C. ASCII码定义的字符分为图形字符与控制字符两类
答:D. ASCII码定义的控制字符可用于HDLC协议


把网络202.112.78.0划分为多个子网（子网掩码是255.255.255.192），则子网中可用的主机地址总数是（ ）。
A. 254
B. 252
C. 128
答:D. 62








以下关于WEB.刘览器结构描述中，错误的是
选择一项:
O A.控制单元解释鼠标点击与键盘输入，并调用其他组件来执行用户指定的操作◎
B. Web浏览器由一组客户.- -组解释单元与-一个管理它们的控制单元组成◎
C.许多浏览器包含-个FTP解释器，用来获取GIP文件传输服务◎
D. HTTP解释器解释页面，并将解释的结果显示在用户屏幕上
答案: C


电信级的网络必须保证为用户提供
选择- -项:
。A.7x24服务
B.1 x 24服务◎
C.5 x 24服务
D.3 x 24服务
答案:A


网络安全的研究除了涉及技术.管理，道德问题之外，还有一个重要的问题是 ..
选择-项:
A.观念
B.法律◎
C.教育◎
D.文化
答案: B


TC.P/IP参考模型中的主机一网络层对应于OSI参考模型的.. 1 .物理层2数据链路层3网络层
选择一项:◎
A. 1和2
B. 1
C. 3
◎
D. I.2和3
答案: A


以下关于IP地址的描述中，错误的是.
选择-项:
◎A.如果一台主机通过多个网卡分别连接到多个网络，必须为每一个接口分配一 个IP地址◎
B.连接的互联网的每一台主机或者路由器都有一个IP地址
◎C.原则上互联网上的任何两台主机和路由器都不会有相同的IP地址
◎D.如果一条线路互联两台路由器，一条线路的两个端口可以共用一 个IP地址
答案:D


帧中继网提供VPN服务是在
选择-项:
◎A.数据链路层◎
B.网络层◎
C.物理层◎
D.传输层
答案:A



以下关于影响传感器网络拓扑结构动态变化因素的描述中，错误的是
选择-项:
◎A.环境因素或电能耗尽造成的传感器结点的故障或失效◎
B.新结点的加入
◎C.路由选择协议的变化
@ D.环境条件变化可能造成无线通信链路的改变
答案: C




以下关于HD.LC.信息帧的描述中，错误的是
选择一项:
日A.接收序号N R.表示已正确接收序号为.N R.- -I.的帧及以前各帧
B. P与F在帧交换过程中应成对出现
◎C.对于NRM，探询位P=O,表示只有主站向从站发出"探询”◎
D.发送序号N S.表示当前发送的信息帧的序号
答案:C





OSI参考模型定义了开放系统的层次结构.层次之间的相互关系及各层所包括的可能的..
选择-项:◎
A.服务
◎B.通信模型◎
C.协议
D.接口答案:
A



以下关于曼彻斯特编码特点的描述中，错误的是
选择一项:
◎A.每比特的周期T分为前T/2与后T/2两部分
◎B.两次电平跳变的时间间隔可以是T/2,利用电平跳变可以产生同步信号◎
C.前T/2传送该比特的反码，后T/2传送该比特的原码◎
D.曼彻斯特编码信号是一种自含时钟编码
答案: B


以下关于城域网建设方案特点的描述中，那些是正确的? ..
1 .主干传输介质采用光纤2交换结点采用基于IP交换的高速路由交换机或A.TM交换机3.
采用ISO/OSI七层结构模型4采用核心交换层，业务汇聚层与接入层3层模式

选择-项:
◎A. 1.2和4
B. 1.2和3
C. 1.3和4
D. 2和3
答案: A



以下关于POP3协议特点的描述中，错误的是选择-项:
◎A. POP3协议提供将存储在目的SMTP服务器中的邮件报文传递到用户的机制O
B. POP3协议有两种工作模式:删除模式与保留模式
◎C.保留模式实在一-次读取邮件后 ，仍然将读过的邮件保存在服务器中◎
D.删除模式是在一次读取邮件后，只把读到客户端的邮件删除
答案:D


在路由器互联的多个局域网中，通常要求每个局域网的
选择-项:
◎A.数据链路层协议必须相同，而物理层协议可以不同◎
B.数据链路层协议和物理层协议都必须相同
◎C.数据链层协议可以不同，而物理层协议必须相同◎
D.数据链路层协议和物理层协议都可以不相同
答案: D

如果发送的数据比特序列为，生成多项式G x.的二进制比特序列长度为11010010,那么在发送的数据比特序列中C.RC.校验比特序列为..
选择一项:
A.11010110
B.1010110
C.10110◎
D.010110
答案: B


建立计算机网络的主要目的是实现计算机资源的共享.计算机资源主要指计算机的.. 1 .硬件软件2 Web服务器数据库服务器3数据4.网络操作系统
选择一项:0
A. 2和4
B. 1和2
C. 1.2和4
D. 1和3
答案:D


以下哪个不属于OSI参考模型结构定义的层次结构术语?
选择-项:
。A. 主机- -网络层◎
B.物理层◎
C.应用层
D.会话层
答案: A


计算机网络拓扑是通过网络中结点与通信线路之间的几何关系表示网络中各实体间的
选择一项:
◎A.结构关系◎
B.联机关系◎
C.层次关系◎
D.主次关系
答案:A


在同步网络中所有的时钟都通过参考时钟PRC.获取，其精度必须保持在
选择-项:
A.+1x10-11
B. +1 x 10-6◎
C. +1 x 10-9
D.士1 x10-3
答案: A


虚拟局域网通常采用交换机端口号.MA.C.地址.网络层地址或
.
选择-项:
◎A.网桥定义
◎B.操作系统定义◎
C.物理网段定义
◎D. IP广播组地址定义
答案: D

A.SE-T标准规定网卡与HUB.之间的非屏蔽双绞线长度最大为
选择-项:◎
A.500米◎
B.100米◎
C.200米O
D.50米
答案: B


29题






















""".trimIndent()